INSERT INTO `rooms` (`r_id`, `r_name`, `r_space`)
VALUES
(1, 'Комната с двумя компьютерами', 5),
(2, 'Комната с тремя компьютерами', 5),
(3, 'Пустая комната 1', 2),
(4, 'Пустая комната 2', 2),
(5, 'Пустая комната 3', 2);


INSERT INTO `computers` (`c_id`, `c_room`, `c_name`)
VALUES
(1, 1, 'Компьютер A в комнате 1'),
(2, 1, 'Компьютер B в комнате 1'),
(3, 2, 'Компьютер A в комнате 2'),
(4, 2, 'Компьютер B в комнате 2'),
(5, 2, 'Компьютер C в комнате 2'),
(6, NULL, 'Свободный компьютер A'),
(7, NULL, 'Свободный компьютер B'),
(8, NULL, 'Свободный компьютер C');


INSERT INTO `library_in_json`
(
    `lij_id`,
    `lij_book`,
    `lij_author`,
    `lij_genre`
) VALUES
(1, 'Евгений Онегин', '[{"id":7,"name":"А.С. Пушкин"}]', '[{"id":1,"name":"Поэзия"},{"id":5,"name":"Классика"}]'),
(2, 'Искусство программирования', '[{"id":1,"name":"Д. Кнут"}]', '[{"id":2,"name":"Программирование"},{"id":5,"name":"Классика"}]'),
(3, 'Курс теоретической физики', '[{"id":4,"name":"Л.Д. Ландау"},{"id":5,"name":"Е.М. Лифшиц"}]', '[{"id":5,"name":"Классика"}]'),
(4, 'Основание и империя', '[{"id":2,"name":"А. Азимов"}]', '[{"id":6,"name":"Фантастика"}]'),
(5, 'Психология программирования', '[{"id":3,"name":"Д. Карнеги"},{"id":6,"name":"Б. Страуструп"}]', '[{"id":2,"name":"Программирование"},{"id":3,"name":"Психология"}]'),
(6, 'Сказка о рыбаке и рыбке', '[{"id":7,"name":"А.С. Пушкин"}]', '[{"id":1,"name":"Поэзия"},{"id":5,"name":"Классика"}]'),
(7, 'Язык программирования С++', '[{"id":6,"name":"Б. Страуструп"}]', '[{"id":2,"name":"Программирование"}]');



INSERT INTO `site_pages` (`sp_id`, `sp_parent`, `sp_name`) VALUES
(1, NULL, 'Главная'),
(2, 1, 'Читателям'),
(3, 1, 'Спонсорам'),
(4, 1, 'Рекламодателям'),
(5, 2, 'Новости'),
(6, 2, 'Статистика'),
(7, 3, 'Предложения'),
(8, 3, 'Истории успеха'),
(9, 4, 'Акции'),
(10, 1, 'Контакты'),
(11, 3, 'Документы'),
(12, 6, 'Текущая'),
(13, 6, 'Архивная'),
(14, 6, 'Неофициальная');

INSERT INTO `cities` (`ct_id`, `ct_name`) VALUES
(1, 'Лондон'),
(2, 'Париж'),
(3, 'Мадрид'),
(4, 'Токио'),
(5, 'Москва'),
(6, 'Киев'),
(7, 'Минск'),
(8, 'Рига'),
(9, 'Варшава'),
(10, 'Берлин');

INSERT INTO `connections` (`cn_from`, `cn_to`, `cn_cost`, `cn_bidir`) VALUES
(1, 5, 10, 'Y'),
(1, 7, 20, 'N'),
(7, 1, 25, 'N'),
(7, 2, 15, 'Y'),
(2, 6, 50, 'N'),
(6, 8, 40, 'Y'),
(8, 4, 30, 'N'),
(4, 8, 35, 'N'),
(8, 9, 15, 'Y'),
(9, 1, 20, 'N'),
(7, 3, 5, 'N'),
(3, 6, 5, 'N');


INSERT INTO `shopping`
(
    `sh_id`,
    `sh_transaction`,
    `sh_category`
) VALUES
(1, 1, 'Сумка'),
(2, 1, 'Платье'),
(3, 1, 'Сумка'),
(4, 2, 'Сумка'),
(5, 2, 'Юбка'),
(6, 3, 'Платье'),
(7, 3, 'Юбка'),
(8, 3, 'Туфли'),
(9, 3, 'Шляпка'),
(10, 4, 'Сумка');